Vorlesung/ProPar-CoreLogicAnwndngn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2018-09-25 Tue 15:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Anwendungen mit core.logic</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Anwendungen mit core.logic
<br />
<span class="subtitle">Programmierparadigmen</span>
</h1>

<div id="outline-container-org608351b" class="outline-2">
<h2 id="org608351b">Elementare Beispiele</h2>
<div class="outline-text-2" id="text-org608351b">
<ul class="org-ul">
<li><p>
Einbindung der <a href="https://github.com/clojure/core.logic">core.logic-Bibliothek</a>:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span><span style="color: #006FE0;">use</span> 'clojure.core.logic<span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span><span style="color: #006FE0;">use</span> 'clojure.core.logic.pldb<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
nilnil

</pre></li>
</ul>
</div>

<div id="outline-container-orge3b96ee" class="outline-3">
<h3 id="orge3b96ee">Liebesbeziehungen</h3>
<div class="outline-text-3" id="text-orge3b96ee">
<ul class="org-ul">
<li>Definition von Fakten; hier: Es gibt Männer &#x2026;</li>
</ul>
<div class="org-src-container">
<pre class="src src-clojure"> <span style="color: #707183;">(</span>db-rel man x<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/man

</pre>

<ul class="org-ul">
<li><p>
&#x2026; und zwar diese:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">men</span>
           <span style="color: #7388D6;">(</span>db
             <span style="color: #909183;">[</span>man 'Bob<span style="color: #909183;">]</span>
             <span style="color: #909183;">[</span>man 'John<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/men

</pre></li>

<li><p>
Frage: Wer ist Mann?
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>with-db men
           <span style="color: #7388D6;">(</span>run* <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span> <span style="color: #909183;">(</span>man q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(John Bob)
</p></li>

<li><p>
Weitere Relation und ein Faktum:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>db-rel fun x<span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">fun-people</span>
           <span style="color: #7388D6;">(</span>db
             <span style="color: #909183;">[</span>fun 'Bob<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/fun #'user/fun-people

</pre></li>

<li><p>
Welche Männer sind amüsant?
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>with-dbs <span style="color: #7388D6;">[</span>men fun-people<span style="color: #7388D6;">]</span>
           <span style="color: #7388D6;">(</span>run* <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span>
             <span style="color: #909183;">(</span>man q<span style="color: #909183;">)</span>
             <span style="color: #909183;">(</span>fun q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
(Bob)
</p></li>

<li><p>
Frauen und Liebesbeziehungen:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>db-rel woman x<span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">facts</span>
           <span style="color: #7388D6;">(</span>db
             <span style="color: #909183;">[</span>woman 'Lucy<span style="color: #909183;">]</span>
             <span style="color: #909183;">[</span>woman 'Mary<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span>db-rel likes x y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/woman #'user/facts #'user/likes

</pre>

<p>
Die Faktendatenbank hat jetzt einen generischen Namen: <code>facts</code>
</p></li>

<li><p>
Erweiterung von <code>facts</code>
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">facts</span>
           <span style="color: #7388D6;">(</span><span style="color: #0000FF;">-&gt;</span> facts
             <span style="color: #909183;">(</span>db-fact likes 'Bob 'Mary<span style="color: #909183;">)</span>
             <span style="color: #909183;">(</span>db-fact likes 'John 'Lucy<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span>with-dbs <span style="color: #7388D6;">[</span>men facts<span style="color: #7388D6;">]</span> <span style="color: #7388D6;">(</span>run* <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span> <span style="color: #909183;">(</span>likes 'Bob q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/facts (Mary)

</pre></li>

<li><p>
Wen liebt Mary?
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>with-dbs <span style="color: #7388D6;">[</span>men facts<span style="color: #7388D6;">]</span> <span style="color: #7388D6;">(</span>run* <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span> <span style="color: #909183;">(</span>likes 'Mary q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
()
</p></li>

<li><p>
erneute Erweiterung von <code>facts</code> und Erweiterung der Frage
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">facts</span> <span style="color: #7388D6;">(</span>db-fact facts likes 'Mary 'Bob<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span>with-dbs <span style="color: #7388D6;">[</span>men facts<span style="color: #7388D6;">]</span> <span style="color: #7388D6;">(</span>run* <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span> <span style="color: #909183;">(</span>fresh <span style="color: #709870;">[</span>x y<span style="color: #709870;">]</span> <span style="color: #709870;">(</span>likes x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>== q <span style="color: #907373;">[</span>x y<span style="color: #907373;">]</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/facts ([Bob Mary] [Mary Bob] [John Lucy])

</pre></li>

<li><p>
Welche Frage wird mit dem folgenden Ausdruck beantwortet?
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>with-dbs <span style="color: #7388D6;">[</span>men facts<span style="color: #7388D6;">]</span> <span style="color: #7388D6;">(</span>run* <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span> <span style="color: #909183;">(</span>fresh <span style="color: #709870;">[</span>x y<span style="color: #709870;">]</span> <span style="color: #709870;">(</span>likes x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>likes y x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>== q <span style="color: #907373;">[</span>x y<span style="color: #907373;">]</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Bob</td>
<td class="org-left">Mary</td>
</tr>

<tr>
<td class="org-left">Mary</td>
<td class="org-left">Bob</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-orgab7be71" class="outline-3">
<h3 id="orgab7be71">Das Bibel-Beispiel</h3>
<div class="outline-text-3" id="text-orgab7be71">
</div>
<div id="outline-container-org7fb8547" class="outline-4">
<h4 id="org7fb8547">Die Prolog-Version</h4>
<div class="outline-text-4" id="text-org7fb8547">
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #006699;">father</span>(abraham,isaac).
<span style="color: #006699;">father</span>(haran,lot).
<span style="color: #006699;">father</span>(haran,milcah).
<span style="color: #006699;">father</span>(haran,yiscah).
<span style="color: #006699;">male</span>(isaac).
<span style="color: #006699;">male</span>(lot).
<span style="color: #006699;">female</span>(milcah).
<span style="color: #006699;">female</span>(yiscah).
<span style="color: #006699;">son</span>(<span style="color: #BA36A5;">X</span>,<span style="color: #BA36A5;">Y</span>) :- father(<span style="color: #BA36A5;">Y</span>,<span style="color: #BA36A5;">X</span>), male(<span style="color: #BA36A5;">X</span>).
<span style="color: #006699;">daughter</span>(<span style="color: #BA36A5;">X</span>,<span style="color: #BA36A5;">Y</span>) :- father(<span style="color: #BA36A5;">Y</span>,<span style="color: #BA36A5;">X</span>), female(<span style="color: #BA36A5;">X</span>).
</pre>
</div>
</div>
</div>

<div id="outline-container-org8eb62d4" class="outline-4">
<h4 id="org8eb62d4">Eine core-logic-Version</h4>
<div class="outline-text-4" id="text-org8eb62d4">
<ul class="org-ul">
<li><p>
Definition der Relationen und Fakten:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>db-rel father f s<span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span>db-rel male m<span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span>db-rel female f<span style="color: #707183;">)</span>
  <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">bible-facts</span>
    <span style="color: #7388D6;">(</span>db <span style="color: #909183;">[</span>father 'abraham 'isaac<span style="color: #909183;">]</span>
        <span style="color: #909183;">[</span>father 'haran 'lot<span style="color: #909183;">]</span>
        <span style="color: #909183;">[</span>father 'haran 'milcah<span style="color: #909183;">]</span>
        <span style="color: #909183;">[</span>father 'haran 'yiscah<span style="color: #909183;">]</span>
        <span style="color: #909183;">[</span>male 'isaac<span style="color: #909183;">]</span>
        <span style="color: #909183;">[</span>male 'lot<span style="color: #909183;">]</span>
        <span style="color: #909183;">[</span>female 'milcah<span style="color: #909183;">]</span>
        <span style="color: #909183;">[</span>female 'yiscah<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/father #'user/male #'user/female #'user/bible-facts

</pre></li>

<li><p>
Relationen können als Funktionen definiert werden:
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">son</span> <span style="color: #7388D6;">[</span>x y<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>all
     <span style="color: #909183;">(</span>father y x<span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>male x<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

  <span style="color: #707183;">(</span><span style="color: #0000FF;">defn</span> <span style="color: #006699;">daughter</span> <span style="color: #7388D6;">[</span>x y<span style="color: #7388D6;">]</span>
    <span style="color: #7388D6;">(</span>all
     <span style="color: #909183;">(</span>father y x<span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span>female x<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'user/son #'user/daughter

</pre></li>

<li><p>
Fragen in der bekannten Art
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #707183;">(</span>with-db bible-facts <span style="color: #7388D6;">(</span>run* <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span> <span style="color: #909183;">(</span>daughter 'yiscah q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">haran</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Johannes Brauer</p>
<p class="date">Created: 2018-09-25 Tue 15:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>